#  Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
#     Примеры: 
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90


# num1 = int(input('введите число 1 ')) 
# num2 = int(input('введите число 2 ')) 
# num3 = int(input('введите число 3 ')) 
# num4 = int(input('введите число 4 ')) 
# num5 = int(input('введите число 5 ')) 
# a = [num1, num2, num3, num4, num5]
# max=a[0]
# i=0
# while i<len(a):
#     if a[i]>max:
#         max=a[i]
#     i+=1
#  

# print(max)

# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.  
#     *Примеры:*   
#     - 6,78 -> 7
#     - 5 -> нет
#     - 0,34 -> 3



# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
# является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# num = int(input('Введиле число от 1 до 7:  '))
# if num>7 or num<0:
#     print(' :( Мимо') 
# if 0<num<6:
#     print('нет')
# if 6<=num<=7:
#     print('да')


# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

x = int(input('Введите х: '))
y = int(input('Введите у: '))
if x>0 and y>0:
    print('1')
if x<0 and y>0:
    print('2')
if x<0 and y<0:
    print('3')
if x>0 and y<0:
    print('4')
if x==0 or y==0:
    print('Упс, так не пойдет :(')

# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек 
# в этой четверти (x и y).


# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21