# Семинар 1

# Задача 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
# является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# num = int(input('Введиле число от 1 до 7:  '))
# if num>7 or num<0:
#     print(' :( Мимо') 
# if 0<num<6:
#     print('нет')
# if 6<=num<=7:
#     print('да') 


# Задача 2. Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# не помню я что все это значит...

# Задача 3. Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

# x = int(input('Введите х: '))
# y = int(input('Введите у: '))
# if x>0 and y>0:
#     print('1')
# if x<0 and y>0:
#     print('2')
# if x<0 and y<0:
#     print('3')
# if x>0 and y<0:
#     print('4')
# if x==0 or y==0:
#     print('Упс, так не пойдет :(')

# Задача 3. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек 
# в этой четверти (x и y).

# chet = int(input("Введите номер четверти: "))
# if chet < 1 or chet >4:
#     print("Такой четверти нет")
# if chet == 1:
#     print('Возможные координаты: х (0, +бесконечность), y(0, +бесконечность) ')
# if chet == 2:
#     print('Возможные координаты: х (-бесконечность, 0), y(0, +бесконечность) ')
# if chet == 3:
#     print('Возможные координаты: х (-бесконечность, 0), y(-бесконечность, 0) ')
# if chet == 4:
#     print('Возможные координаты: х (0: +бесконечность), y(-бесконечность, 0) ')
    


# Задача 4. Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# d = √ [(x2-x1)2+ (y2-y1)2]
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
# import math

# x1 = int(input('Введите х1: '))
# y1 = int(input('Введите у1: '))
# x2 = int(input('Введите х2: '))
# y2 = int(input('Введите у2: '))
# d = math.sqrt((x2-x1)**2+ (y2-y1)**2)
# print(round(d,2))
